
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 0 to add, 3 to change, 2 to destroy.</code></pre>

* Update
  * azurerm_resource_group.rg
  * module.ia_case_api_database_11.azurerm_resource_group.data-resourcegroup
  * module.ia_case_api_database_11.azurerm_template_deployment.postgres-paas
* Delete
  * azurerm_key_vault_secret.local_app_insights_connection_string
  * azurerm_key_vault_secret.local_ia_config_validator_secret


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.local_app_insights_connection_string will be destroyed
  # (because azurerm_key_vault_secret.local_app_insights_connection_string is not in configuration)
  - resource "azurerm_key_vault_secret" "local_app_insights_connection_string" {
      - content_type            = "" -> null
      - id                      = "https://ia-aat.vault.azure.net/secrets/app-insights-connection-string/405f1c25310349aaa5ab98fec50a5867" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat" -> null
      - name                    = "app-insights-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat/secrets/app-insights-connection-string/versions/405f1c25310349aaa5ab98fec50a5867" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat/secrets/app-insights-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "405f1c25310349aaa5ab98fec50a5867" -> null
      - versionless_id          = "https://ia-aat.vault.azure.net/secrets/app-insights-connection-string" -> null
    }

  # azurerm_key_vault_secret.local_ia_config_validator_secret will be destroyed
  # (because azurerm_key_vault_secret.local_ia_config_validator_secret is not in configuration)
  - resource "azurerm_key_vault_secret" "local_ia_config_validator_secret" {
      - id                      = "https://ia-aat.vault.azure.net/secrets/ia-config-validator-secret/71d04d460d5944029fc9e46d0d0b5b88" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat" -> null
      - name                    = "ia-config-validator-secret" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat/secrets/ia-config-validator-secret/versions/71d04d460d5944029fc9e46d0d0b5b88" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-aat/providers/Microsoft.KeyVault/vaults/ia-aat/secrets/ia-config-validator-secret" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "71d04d460d5944029fc9e46d0d0b5b88" -> null
      - versionless_id          = "https://ia-aat.vault.azure.net/secrets/ia-config-validator-secret" -> null
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-aat"
        name     = "ia-case-api-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ia-case-api.git"
          - "application"         = "immigration"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-07-26T14:58:41Z"
          - "managedBy"           = "Immigration"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ia_case_api_database_11.data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "ia-case-api-postgres-11-db-aat"
      + resource_group_name = "ia-case-api-postgres-11-db-data-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.ia_case_api_database_11.azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-11-db-data-aat"
        name     = "ia-case-api-postgres-11-db-data-aat"
      ~ tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/ia-case-api.git"
          - "application"         = "immigration"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#ia-tech"
          - "environment"         = "staging"
          - "lastUpdated"         = "2023-07-26T14:58:36Z"
          - "managedBy"           = "Immigration"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.ia_case_api_database_11.azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/ia-case-api-postgres-11-db-data-aat/providers/Microsoft.Resources/deployments/ia-case-api-postgres-11-db-aat"
        name                = "ia-case-api-postgres-11-db-aat"
      ~ parameters          = {
          - "administratorLogin"         = "ia_case_api"
          - "administratorLoginPassword" = "nL?:UK:$YdF{<I$%"
          - "backupRetentionDays"        = "35"
          - "charset"                    = "utf8"
          - "collation"                  = "en-GB"
          - "commonTags"                 = "eyJCdWlsdEZyb20iOiJodHRwczovL2dpdGh1Yi5jb20vSE1DVFMvaWEtY2FzZS1hcGkuZ2l0IiwiYXBwbGljYXRpb24iOiJpbW1pZ3JhdGlvbiIsImJ1c2luZXNzQXJlYSI6IkNGVCIsImNoYW5nZVVybCI6IiIsImNvbnRhY3RTbGFja0NoYW5uZWwiOiIjaWEtdGVjaCIsImVudmlyb25tZW50Ijoic3RhZ2luZyIsImxhc3RVcGRhdGVkIjoiMjAyMy0wNy0yNlQxNDo1ODozNloiLCJtYW5hZ2VkQnkiOiJJbW1pZ3JhdGlvbiJ9"
          - "dbName"                     = "ia_case_api"
          - "dbRules"                    = "W3sicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoiY2Z0YWtzLXRmLWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvOTZjMjc0Y2UtODQ2ZC00ZTQ4LTg5YTctZDUyODQzMjI5OGE3L3Jlc291cmNlR3JvdXBzL2NmdC1hYXQtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NmdC1hYXQtdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYXNlIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvMWM0ZjA3MDQtYTI5ZS00MDNkLWI3MTktYjkwYzM0ZWYxNGM5L3Jlc291cmNlR3JvdXBzL2NvcmUtaW5mcmEtYWF0L3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvY29yZS1pbmZyYS12bmV0LWFhdC9zdWJuZXRzL2NvcmUtaW5mcmEtc3VibmV0LTMtYWF0In0seyJydWxlX25hbWUiOiJha3MiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8xYzRmMDcwNC1hMjllLTQwM2QtYjcxOS1iOTBjMzRlZjE0YzkvcmVzb3VyY2VHcm91cHMvY29yZS1pbmZyYS1hYXQvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jb3JlLWluZnJhLXZuZXQtYWF0L3N1Ym5ldHMvYWtzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcyIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9pYWFzIn0seyJydWxlX25hbWUiOiJqZW5raW5zLWFrcy1hZ2VudCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFiYWY1NDcwLTFjM2UtNDBkMy1hNmY3LTc0YmZiY2U0YjM0OC9yZXNvdXJjZUdyb3Vwcy9jZnQtcHRsLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9jZnQtcHRsLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy10ZXN0LWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvM2VlYzViZGUtN2ZlYi00NTY2LWJmYjYtODA1ZGY2ZTEwYjkwL3Jlc291cmNlR3JvdXBzL3NzLXRlc3QtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLXRlc3Qtdm5ldC9zdWJuZXRzL2Frcy0wMCJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLXRlc3QtYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy8zZWVjNWJkZS03ZmViLTQ1NjYtYmZiNi04MDVkZjZlMTBiOTAvcmVzb3VyY2VHcm91cHMvc3MtdGVzdC1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtdGVzdC12bmV0L3N1Ym5ldHMvYWtzLTAxIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtc3RnLWFrczAwIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvNzRkYWNkNGYtYTI0OC00NWJiLWEyZjAtYWY3MDBkYzRjZjY4L3Jlc291cmNlR3JvdXBzL3NzLXN0Zy1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3Mtc3RnLXZuZXQvc3VibmV0cy9ha3MtMDAifSx7InJ1bGVfbmFtZSI6InNoYXJlZC1zZXJ2aWNlcy1zdGctYWtzMDEiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy83NGRhY2Q0Zi1hMjQ4LTQ1YmItYTJmMC1hZjcwMGRjNGNmNjgvcmVzb3VyY2VHcm91cHMvc3Mtc3RnLW5ldHdvcmstcmcvcHJvdmlkZXJzL01pY3Jvc29mdC5OZXR3b3JrL3ZpcnR1YWxOZXR3b3Jrcy9zcy1zdGctdm5ldC9zdWJuZXRzL2Frcy0wMSJ9LHsicnVsZV9uYW1lIjoiYmFzdGlvbi1ub25wcm9kLXZuZXQiLCJzdWJuZXRfaWQiOiIvc3Vic2NyaXB0aW9ucy9iNDRlYjQ3OS05YWUyLTQyZTctOWM2My1mM2M1OTk3MTliNmYvcmVzb3VyY2VHcm91cHMvYmFzdGlvbi1ub25wcm9kLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3MvYmFzdGlvbi1ub25wcm9kLXZuZXQvc3VibmV0cy9iYXN0aW9uIn0seyJydWxlX25hbWUiOiJpZGFtLWFhdDItdm5ldCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzFjNGYwNzA0LWEyOWUtNDAzZC1iNzE5LWI5MGMzNGVmMTRjOS9yZXNvdXJjZUdyb3Vwcy9jb3JlLWluZnJhLWlkYW0tYWF0Mi9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL2NvcmUtaW5mcmEtdm5ldC1pZGFtLWFhdDIvc3VibmV0cy9jb3JlLWluZnJhLXN1Ym5ldC03LWlkYW0tYWF0MiJ9LHsicnVsZV9uYW1lIjoic2hhcmVkLXNlcnZpY2VzLWRldi1ha3MwMCIsInN1Ym5ldF9pZCI6Ii9zdWJzY3JpcHRpb25zLzg2N2E4NzhiLWNiNjgtNGRlNS05NzQxLTM2MWFjOWUxNzhiNi9yZXNvdXJjZUdyb3Vwcy9zcy1kZXYtbmV0d29yay1yZy9wcm92aWRlcnMvTWljcm9zb2Z0Lk5ldHdvcmsvdmlydHVhbE5ldHdvcmtzL3NzLWRldi12bmV0L3N1Ym5ldHMvYWtzLTAwIn0seyJydWxlX25hbWUiOiJzaGFyZWQtc2VydmljZXMtZGV2LWFrczAxIiwic3VibmV0X2lkIjoiL3N1YnNjcmlwdGlvbnMvODY3YTg3OGItY2I2OC00ZGU1LTk3NDEtMzYxYWM5ZTE3OGI2L3Jlc291cmNlR3JvdXBzL3NzLWRldi1uZXR3b3JrLXJnL3Byb3ZpZGVycy9NaWNyb3NvZnQuTmV0d29yay92aXJ0dWFsTmV0d29ya3Mvc3MtZGV2LXZuZXQvc3VibmV0cy9ha3MtMDEifV0="
          - "env"                        = "aat"
          - "geoRedundantBackup"         = "Enabled"
          - "location"                   = "UK South"
          - "serverName"                 = "ia-case-api-postgres-11-db-aat"
          - "skuCapacity"                = "2"
          - "skuName"                    = "GP_Gen5_2"
          - "skuSizeMB"                  = "51200"
          - "skuTier"                    = "GeneralPurpose"
          - "sslEnforcement"             = "Enabled"
          - "version"                    = "11"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1526,"Program":"tfcmt","SHA1":"","Vars":{}} -->